sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setRelationships.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setrelationships">
   <soapenv:Header/>
   <soapenv:Body>
   	 <sug:sugarcrmUrl>https://ypbvhe6054.trial.sugarcrm.com/soap.php</sug:sugarcrmUrl>
   	 <sug:sessionId>ennekve4ldq7nku6m8ogu1csu3</sug:sessionId>
   	 <sug:set_relationship_list>
   	 	<set_relationship_value>
               <module1>Accounts</module1>
               <module1_id>4f133329-7d60-8b1a-60c5-523cee8eadee</module1_id>
               <module2>Contacts</module2>
               <module2_id>f21800bb-699f-9e88-6a29-523cc7d35d75</module2_id>
            </set_relationship_value>
            <set_relationship_value>
               <module1>Accounts</module1>
               <module1_id>afaab2e4-5151-f1ca-44c9-523cc7721518</module1_id>
               <module2>Contacts</module2>
               <module2_id>f21800bb-699f-9e88-6a29-523cc7d35d75</module2_id>
            </set_relationship_value>
      </sug:set_relationship_list>   	
   </soapenv:Body>
</soapenv:Envelope>